# -*- coding: utf-8 -*-

# (цикл while)

# даны целые положительные числа a и b (a > b)
# Определить результат целочисленного деления a на b, с помощью цикла while,
# __НЕ__ используя стандартную операцию целочисленного деления (// и %)
# Формат вывода:
#   Целочисленное деление ХХХ на YYY дает ZZZ

a, b = 370, 370
i = 0
tmp = a
while (tmp - b) >= 0:
    i += 1
    tmp = tmp - b
print("Целочисленное деление = ", i)
